def october_21():
    return f'''kami-bot小日志历史【10月】~
10月15日：
-添加回复“我是”功能
-添加查询天气功能
-添加复读功能
==========================
10月18日：
- 添加了nonebot商店的帮助列表插件
- 添加了所有插件的简介
- 添加了[你是]指令
- 添加了俄罗斯轮盘游戏（见[help]指令）
- 改变了部分插件的排版
==========================
10月19日：
- 改变了部分插件的排版
- 略微更改了所有插件的帮助简介
- 更改了俄罗斯轮盘插件的部分文案
- 添加了部分俄罗斯轮盘插件的文案
- 将俄罗斯轮盘插件每日签到可获得的金币范围从1~100增加为100~500
- 将俄罗斯轮盘插件装弹时可用的金额从1000增加到了2000
- 添加了抽签功能（见[help]指令）
==========================
10月20日：
- kami-bot已经可以正常使用
- 所有人的轮盘签到已重置
- 添加了greeting插件
- 添加了love插件
- 添加了tarot插件（目前仅有44张大阿卡那牌）
==========================
10月24日：
- kami-bot已恢复更新
- 塔罗牌功能已可以正常使用
- 部分插件无法正常输出简介
==========================
10月26日：
- 简化了help指令的文本，详情见[help]指令
- 添加了计算机功能
- 添加了COC骰子娘插件
- 添加了love插件的部分文本和关键词
==========================
10月27日：
- 添加了塔罗牌功能的图片
==========================
10月28日：
- 添加了二次元句子功能
==========================
10月30日：
- kami于 【纽约时间10月29日 23点35分】 之后便没有连接上服务器，以至于这之后kami都没有任何回应
- 现已在 【纽约时间10月30日 8点32分】 重启
- 所有人的轮盘签到次数已重置
- 所有使用过轮盘签到功能的人金币增加500
- 删除了未开发完的监视学习功能'''


def november_21():
    return f'''kami-bot小日志历史【11月】~
11月01日：
- 删除了COC骰子娘插件
==========================
11月02日：
- 添加了抖音小学生句子功能
- 添加了英语诗功能
- 添加了每日唐诗功能
==========================
11月03日：
- 添加了抖音小学生语录插件的部分文本
==========================
11月04日：
- 添加了抖音小学生语录插件的部分文本
==========================
11月06日：
- 添加了点歌音乐
- 添加了抖音小学生语录插件的部分文本
- 将俄罗斯轮盘插件每日签到限制的金币上限从5000增加为10000
==========================
11月07日：
- 添加了答案之书功能
- 添加了鲁迅说功能
- 添加了部分插件的作者名
- 添加了所有插件的名字
- 删除了每日唐诗功能
- 删除了英文诗功能
- 修改了help功能的部分文字排列
- 修改了部分插件的简介
==========================
11月08日：
- 添加了朋友说功能
==========================
11月09日：
- 删除了俄罗斯轮盘插件每日签到限制的金币上限
- 删除了每日抽签功能
- 统一了每日抽签和轮盘签到功能
==========================
11月13日：
- 添加了测试用插件
==========================
11月20日：
- 添加了每日体检功能
- 添加了猜测缩写功能
- 添加了轻量问答功能
- 修改了help功能的部分排列
==========================
11月21日：
- 添加了B站推送功能
- 添加了P站搜图功能
==========================
11月22日：
- 删除了P站搜图功能
- 添加了leetcode插件
==========================
11月25日：
- 删除了how插件
- 删除了how_comment插件
- 修改了russian插件名至game'''


def december_21():
    return f'''hoka-bot小日志历史【12月】~
12月02日：
- 添加了自动回复功能
==========================
12月04日：
- 合并了imkami和yourejb插件至auto-reply插件内
- 修改了yourejb的权限至仅主人号码
- 修改了问答帮助指令至轻量问答帮助
==========================
12月05日：
- 添加了头像相关表情包生成功能
- 添加了在线写代码功能
- 添加了诺基亚图片生成功能
- kamibot 将改名为 hokabot
- 添加了【hoka】指令前缀
==========================
12月06日：
- 添加了私聊作者功能
==========================
12月09日：
- 添加了随机黑丝功能【仅对部分群聊开放】
==========================
12月12日：
- 删除了测试用的功能调用统计
- 添加了rss订阅插件
- 删除了b站推送功能
- 删除了epic喜加一功能
==========================
12月13日：
- 修改了猜测缩写功能的文字排版
==========================
12月18日：
- 添加了图片问答功能
- 添加了为你决定功能
- 改善了invite插件
- 删除了group_manager插件
==========================
12月21日：
- 添加了人生重开插件
==========================
12月23日：
- 添加了CP文生成功能
- 添加了群组抽卡功能
==========================
12月25日：
- 优化了群组抽卡功能
==========================
12月28日：
- 删除了签到功能的每日幸运数字
- 添加了职业功能
- 添加了每日打工功能
- 新增了新年UP卡池'''


def january_22():
    return f'''hoka-bot小日志历史【1月】~
1月3日：
- 优化了每日体检功能 => 名字将会自动首字母大写
==========================
1月9日：
- 添加了更多的logo生成
- 添加了更多的memes生成'''